import React from 'react'

const PrivacyPolicy = () => {
  return ( 
        <div className="max-w-4xl mx-auto pt-34 p-8 text-slate-800 leading-relaxed">
            <h1 className="text-3xl font-bold text-red-600 mb-6 uppercase tracking-tighter">Политика за поверителност</h1>
            <p className="mb-4 font-semibold text-md">Последна актуализация: 01.03.2026 г.</p>
            <section className="mb-6">
                <h2 className="text-xl font-bold mb-3 border-b-2 border-slate-100">ПОЛИТИКА ЗА ПОВЕРИТЕЛНОСТ
                    на „Аутогаз Варна ООД“</h2>
                    <p></p>

                    <p>В „Аутогаз Варна ООД“ (наричани по-долу „Ние“ или „Администраторът“) уважаваме Вашата поверителност и се ангажираме да защитаваме Вашите лични данни. Тази Политика за поверителност обяснява как събираме, използваме и съхраняваме Вашата информация, когато посещавате нашия уебсайт autogas-varna.com.</p>

                    <h3 className='font-semibold'>1. КОЙ Е АДМИНИСТРАТОРЪТ НА ВАШИТЕ ДАННИ?</h3>
                    <p>Администратор на личните данни е фирмата, оперираща под бранда „Аутогаз Варна ООД“.

                    Адрес: гр. Варна, бул.Хр. Смирнрнски

                    Имейл: info@autogas-varna.com

                    Телефон:  052 50 12 19</p>

                    <h3 className='font-semibold'>2. КАКВИ ЛИЧНИ ДАННИ СЪБИРАМЕ?</h3>
                    <p>Ние събираме информация, която Вие предоставяте доброволно чрез формите за контакт или при записване на час за обслужване:</p>

                    <p>Идентификационни данни: Име и фамилия.</p>

                   <p> Данни за контакт: Телефонен номер и имейл адрес.</p>

                    <p>Технически данни: IP адрес, тип браузър и бисквитки (автоматично събирани чрез хостинг платформата и аналитични инструменти).</p>

                    <p>Данни за автомобила: Марка и модел (когато са предоставени в запитването за монтаж на АГУ).</p>

                   <h3 className='font-semibold'> 3. ЦЕЛИ НА ОБРАБОТВАНЕТО</h3>
                   <p> Вашите данни се обработват единствено за следните цели:</p>

                   <p> За обработка на Вашите запитвания за цени и услуги.</p>

                    <p>За записване на час за монтаж или диагностика на газова уредба.</p>

                    <p>За директна комуникация относно технически въпроси по Вашия автомобил.</p>

                    <p>За статистически анализ на посещенията на уебсайта.</p>

                    <h3 className='font-semibold'>4. ПРАВНО ОСНОВАНИЕ ЗА ОБРАБОТКА</h3>
                    <p>Обработваме Вашите данни въз основа на:</p>

                   <p> Преддоговорни отношения: За да отговорим на Вашето запитване за услуга.</p>

                    <p>Легитимен интерес: За подобряване функционалността на нашия сайт.</p>

                    <p>Вашето изрично съгласие: При изпращане на съобщение чрез контактната форма.</p>

                    <h3 className='font-semibold'>5. СПОДЕЛЯНЕ НА ИНФОРМАЦИЯТА</h3>
                    <p>Ние не продаваме и не предоставяме Вашите данни на трети лица за маркетингови цели. Вашите данни могат да бъдат споделени само с:</p>

                    <p>Доставчици на ИТ услуги и хостинг, необходими за техническата поддръжка на сайта.</p>

                    <p>Държавни органи, само когато това е изискуемо по закон.</p>

                    <h3 className='font-semibold'>6. СЪХРАНЕНИЕ НА ДАННИТЕ</h3>
                    <p>Съхраняваме Вашите данни само за периода, необходим за изпълнение на Вашето запитване или докато законът изисква това. Данните от контактната форма се съхраняват до приключване на комуникацията, освен ако не се стигне до реална поръчка/услуга.</p>

                    <h3 className='font-semibold'>7. ВАШИТЕ ПРАВА ПО GDPR</h3>
                    <p>Като субект на данни, Вие имате право на:</p>

                    <p>Достъп до Вашите лични данни.</p>

                    <p>Коригиране на неточни данни.</p>

                   <p> Изтриване („право да бъдеш забравен“).</p>

                    <p>Ограничаване на обработването.</p>

                    <p>Отказ от обработка по всяко време.</p>

                    <p>За да упражните тези права, моля свържете се с нас на: info@autogas-varna.com.</p>

                    <h3 className='font-semibold'>8. ИЗПОЛЗВАНЕ НА „БИСКВИТКИ“</h3>
                   <p> Нашият сайт използва „бисквитки“ (cookies) за техническа функционалност. Можете да управлявате или изтривате бисквитките чрез настройките на Вашия браузър.</p>

                   <h3 className='font-semibold'> 9. ПРОМЕНИ В ПОЛИТИКАТА</h3>
                    <p>Запазваме правото си да актуализираме тази политика. Всички промени ще бъдат публикувани на тази страница с нова дата на актуализация.</p>
            </section>
        </div>
  )
}

export default PrivacyPolicy
