import React, { useState } from 'react'
import Title from './Title'

const Faq = () => {
  const [openIndex, setOpenIndex] = useState(null)
    const faqsData = [
        {
            question: 'Безопасна ли е газовата уредба?',
            answer: 'Газовите уредби са изключително безопасни при спазване на стандартите за монтаж и обслужване. Съвременните системи разполагат с множество предпазни механизми: автоматични клапани при удар, предпазни вентили при превишаване на налягането, защита от изтичане. Резервоарът за газ е многократно по-здрав от обикновения горивен резервоар и издържа на значително по-високо налягане. Статистиката показва, че инцидентите с газовите уредби са изключително редки и се дължат основно на непрофесионален монтаж или липса на редовна поддръжка. При нас всеки монтаж се извършва според европейските стандарти ECE R67/R115.'
        },
        {
            question: 'Колко струва монтажът на газова уредба и за колко време се изплаща?',
            answer: 'Цената на монтажа варира между 750 и 2,500 eвро. Всички цени са зависимост от типа двигател и избраната система. За двигатели с директно впръскване цената е по-висока поради по-сложната технология. При средна цена на газта от 0.55-0.60 евро/литър и бензин около 2.60 лв/литър, икономиите са около 50%. При изминаване на 10,000 км годишно и разход от 8л/100км, инвестицията се възвръща за около 12 месеца. Колкото повече километри изминавате, толкова по-бързо ще се изплати системата.'
        },
        {
            question: 'Губи ли се мощност на двигателя след монтаж на АГУ?',
            answer: 'При правилно монтирана и настроена система загубата на мощност е минимална - между 3% и 5%, което на практика е незабележимо при ежедневното каране. Съвременните системи от BRC, Prins и AEB са проектирани да запазват оригиналните характеристики на двигателя. При двигатели с директно впръскване загубата е още по-малка благодарение на усъвършенстваната електроника. Важно е системата да бъде калибрирана от сертифициран специалист, за да се постигнат оптимални показатели.'
        },
        {
            question: 'Мога ли да монтирам газова уредба на автомобил с турбо двигател или директно впръскване?',
            answer: 'Да, абсолютно! Съвременните автомобилни газови системи 5-то и 6-то поколение (каквито предлагаме от BRC, Prins и AEB) са специално проектирани за турбо двигатели и двигатели с директно впръскване (TSI, FSI, GDI, TFSI). При двигателите с директно впръскване се използва специална технология, при която бензиновите инжектори работят на минимум, за да поддържат смазването на клапаните, а газовите инжектори осигуряват основното захранване. Това гарантира пълна защита на двигателя и запазване на всички негови характеристики. Притежаваме необходимото оборудване и опит за монтаж на най-съвременните двигателни технологии.'
        },
        {
            question: 'Какви са изискванията за поддръжка на газовата уредба и колко често трябва да се прави?',
            answer: 'Газовата уредба изисква минимална поддръжка в сравнение с ползваните икономии. Препоръчва се На всеки 10 000-15 000 км или веднъж годишно смяна на филтрите (газова и течна фаза), проверка на херметичността на системата, диагностика на електрониката.Газовият резервоар има законов срок на годност - обикновено 10 години от производството. Редовната поддръжка гарантира дълъг живот на системата и икономична експлоатация. Всички услуги по поддръжка предлагаме в нашия сервиз на достъпни цени.'


        }
    ]
    return (
        <>
            
            <div className='flex flex-col items-center text-center text-slate-800 px-3 mb-10'>
                
                <Title title="Често задавани въпроси" subTitle="Информация свързана с автомобилните газови уредби." />
                <div className='max-w-3xl w-full mt-6 flex flex-col gap-4 items-start text-left'>
                    {faqsData.map((faq, index) => (
                        <div key={index} className='flex flex-col items-start w-full'>
                            <div className='flex items-center justify-between w-full cursor-pointer border border-indigo-100 p-4 rounded' onClick={() => setOpenIndex(openIndex === index ? null : index)}>
                                <h2 className='text-sm'>{faq.question}</h2>
                                <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg" className={`${openIndex === index ? "rotate-180" : ""} transition-all duration-500 ease-in-out`}>
                                    <path d="m4.5 7.2 3.793 3.793a1 1 0 0 0 1.414 0L13.5 7.2" stroke="#1D293D" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round" />
                                </svg>
                            </div>
                            <p className={`text-sm text-slate-500 px-4 transition-all duration-500 ease-in-out ${openIndex === index ? "opacity-100 max-h-75 translate-y-0 pt-4" : "opacity-0 max-h-0 -translate-y-2"}`} >
                                {faq.answer}
                            </p>
                        </div>
                    ))}
                </div>
            </div>
        </>
    )
}

export default Faq
